benchmarks/6_9_cospec_selective_validation_result_llama_13b/colocation_consolidated_tile_7_0_8_sharegpt_output.txt
INFO 06-11 13:08:32 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='huggyllama/llama-13b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=8.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Split dataset into 8277 test samples and 74494 training samples
Temperature:  0.0
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
result {'is_trained': True}
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 8.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     2167      
Benchmark duration (s):                  300.40    
Total input tokens:                      537249    
Total generated tokens:                  479696    
Request throughput (req/s):              7.21      
Output token throughput (tok/s):         1596.87   
Total Token throughput (tok/s):          3385.34   
---------------Time to First Token----------------
Mean TTFT (ms):                          399.05    
Median TTFT (ms):                        378.45    
P99 TTFT (ms):                           903.92    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          83.34     
Median TPOT (ms):                        71.85     
P99 TPOT (ms):                           219.13    
---------------Inter-token Latency----------------
Mean ITL (ms):                           209.29    
Median ITL (ms):                         184.84    
P99 ITL (ms):                            517.72    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          13083.34  
Median E2EL (ms):                        8569.06   
P99 E2EL (ms):                           65983.84  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 92.58     
Median Token Latency (ms):               77.54     
P99 Token Latency (ms):                  261.87    
==================================================